blog_modern/app/views/users/index.html.erb

    <p>Miembro desde <%= user.created_at.strftime("%B %Y") %></p>
    <div class="meta"><%= user.posts.count %> posts - <%= user.comments.count %> comentarios</div>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = 1
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 1