blog_modern/app/controllers/posts_controller.rb

  def index
    @posts = Post.latest_first.includes(:user)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 1)