blog_modern/app/views/posts/_form.html.erb

  <label>Autor</label>
  <%= f.collection_select :user_id, User.all, :id, :full_name, { prompt: "Seleccionar autor..." } %>
---
SELECT "users".* FROM "users"