blog_modern/app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 2 ORDER BY "comments"."created_at" DESC
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 2
---

<h2 style="margin-top: 2rem; color: #c4b5fd;">Comentarios (<%= @post.comments.count %>)</h2>

<% @post.comments.latest_first.each do |comment| %>

SELECT "users".* FROM "users"
---
  <label>Usuario</label>
  <%= f.collection_select :user_id, User.all, :id, :full_name, { prompt: "Seleccionar..." }, class: "form-control" %>